# Exercise: Analyzing Chinook Database

Preparation I've done:
 - Retrieve the dataset and load it
 - Load the %sql extension and point it at the database
 - Display the tables and an example query

Additional steps you might take:
 - Add libraries for visualization (matplotlib, seaborn, plotly)
 - Add libraries for statistics (numpy)
 - Explore the dataset using SQL and/or pandas

----

1. Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. Limit the result to the first 5 rows.
   > Operations: `SELECT`
2. Find the total number of customers from each country. Display the country name and the corresponding count. Order the results by the count in descending order.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
3. Identify the top 5 genres with the highest number of tracks. Display the genre name along with the total number of tracks for each genre.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
4. Determine the average invoice total for each customer, considering both the album and individual track purchases. Display the customer's first and last name along with the average invoice total. Order the results by the average invoice total in descending order.
   > Operations: `SELECT`, `AVG`, `JOIN`, `GROUP BY`, `ORDER BY`
5. Identify the customer who spent the most on music purchases. Display the customer's first and last name, along with the total amount spent.
   > Operations: `SELECT`, `SUM`, `JOIN`, `GROUP BY`, `ORDER BY`, `LIMIT`

In [1]:
# Load chinook dataset and query it using SQL magic into pandas dataframes
import pandas as pd
import sqlite3
%load_ext sql

# Load data
conn = sqlite3.connect("chinook.sqlite")

# Tell %sql about the database
%sql sqlite:///chinook.sqlite

# List tables in database
query = "SELECT name FROM sqlite_master WHERE type='table';"

# Read data into a Pandas DataFrame
tables = %sql $query

# Print head
display(tables)

# Query to get the first 5 rows of the `albums` table
result = %sql SELECT * FROM albums LIMIT 5;

# Display query result, note that Pandas DataFrame is returned!
display(result)

 * sqlite:///chinook.sqlite
Done.

/var/folders/s6/kn3bkgks0xz8x42qvvcqj5b00000gn/T/ipykernel_76871/3338115602.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

[('albums',),
 ('sqlite_sequence',),
 ('artists',),
 ('customers',),
 ('employees',),
 ('genres',),
 ('invoices',),
 ('invoice_items',),
 ('media_types',),
 ('playlists',),
 ('playlist_track',),
 ('tracks',),
 ('sqlite_stat1',)]

 * sqlite:///chinook.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [2]:
# Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. Limit the result to the first 5 rows.
one = %sql SELECT t.name AS track_name, a.title AS album_title FROM tracks t\
    LEFT JOIN albums a ON t.albumid = a.albumid\
        LIMIT 5;
display(one)

 * sqlite:///chinook.sqlite
Done.

[('For Those About To Rock (We Salute You)', 'For Those About To Rock We Salute You'),
 ('Balls to the Wall', 'Balls to the Wall'),
 ('Fast As a Shark', 'Restless and Wild'),
 ('Restless and Wild', 'Restless and Wild'),
 ('Princess of the Dawn', 'Restless and Wild')]

In [3]:
# Find the total number of customers from each country. Display the country name and the corresponding count. Order the results by the count in descending order.
two = %sql SELECT DISTINCT country, COUNT(customerid) AS total_customers FROM customers GROUP BY country ORDER BY total_customers DESC;
display(two)

 * sqlite:///chinook.sqlite
Done.

[('USA', 13),
 ('Canada', 8),
 ('France', 5),
 ('Brazil', 5),
 ('Germany', 4),
 ('United Kingdom', 3),
 ('Portugal', 2),
 ('India', 2),
 ('Czech Republic', 2),
 ('Sweden', 1),
 ('Spain', 1),
 ('Poland', 1),
 ('Norway', 1),
 ('Netherlands', 1),
 ('Italy', 1),
 ('Ireland', 1),
 ('Hungary', 1),
 ('Finland', 1),
 ('Denmark', 1),
 ('Chile', 1),
 ('Belgium', 1),
 ('Austria', 1),
 ('Australia', 1),
 ('Argentina', 1)]

In [4]:
# Identify the top 5 genres with the highest number of tracks. Display the genre name along with the total number of tracks for each genre.
three = %sql SELECT DISTINCT g.name, COUNT(t.trackid) AS total_tracks FROM genres g LEFT JOIN tracks t ON g.genreid = t.genreid GROUP BY g.name ORDER BY total_tracks DESC LIMIT 5;
display(three)

 * sqlite:///chinook.sqlite
Done.

[('Rock', 1297),
 ('Latin', 579),
 ('Metal', 374),
 ('Alternative & Punk', 332),
 ('Jazz', 130)]

In [5]:
# Determine the average invoice total for each customer, considering both the album and individual track purchases. Display the customer's first and 
# last name along with the average invoice total. Order the results by the average invoice total in descending order.
four = %sql SELECT c.firstname, c.lastname, ROUND(AVG(i.total), 2) AS avg_total\
      FROM customers c \
      LEFT JOIN invoices i ON i.customerid = c.customerid \
      GROUP BY c.customerid ORDER BY avg_total DESC;
display(four)

 * sqlite:///chinook.sqlite
Done.

[('Helena', 'Holý', 7.09),
 ('Richard', 'Cunningham', 6.8),
 ('Luis', 'Rojas', 6.66),
 ('Ladislav', 'Kovács', 6.52),
 ('Hugh', "O'Reilly", 6.52),
 ('Frank', 'Ralston', 6.23),
 ('Julia', 'Barnett', 6.23),
 ('Fynn', 'Zimmermann', 6.23),
 ('Puja', 'Srivastava', 6.11),
 ('Astrid', 'Gruber', 6.09),
 ('Victor', 'Stevens', 6.09),
 ('Terhi', 'Hämäläinen', 5.95),
 ('František', 'Wichterlová', 5.8),
 ('Isabelle', 'Mercier', 5.8),
 ('Johannes', 'Van der Berg', 5.8),
 ('Luís', 'Gonçalves', 5.66),
 ('François', 'Tremblay', 5.66),
 ('Bjørn', 'Hansen', 5.66),
 ('Jack', 'Smith', 5.66),
 ('Dan', 'Miller', 5.66),
 ('Heather', 'Leacock', 5.66),
 ('João', 'Fernandes', 5.66),
 ('Wyatt', 'Girard', 5.66),
 ('Jennifer', 'Peterson', 5.52),
 ('Tim', 'Goyer', 5.52),
 ('Camille', 'Bernard', 5.52),
 ('Dominique', 'Lefebvre', 5.52),
 ('Joakim', 'Johansson', 5.52),
 ('Manoj', 'Pareek', 5.52),
 ('Leonie', 'Köhler', 5.37),
 ('Daan', 'Peeters', 5.37),
 ('Kara', 'Nielsen', 5.37),
 ('Eduardo', 'Martins', 5.37),
 ('Alexandre', 'Rocha', 5.37),
 ('Roberto', 'Almeida', 5.37),
 ('Fernanda', 'Ramos', 5.37),
 ('Mark', 'Philips', 5.37),
 ('Frank', 'Harris', 5.37),
 ('Michelle', 'Brooks', 5.37),
 ('Kathy', 'Chase', 5.37),
 ('John', 'Gordon', 5.37),
 ('Patrick', 'Gray', 5.37),
 ('Robert', 'Brown', 5.37),
 ('Edward', 'Francis', 5.37),
 ('Martha', 'Silk', 5.37),
 ('Aaron', 'Mitchell', 5.37),
 ('Ellie', 'Sullivan', 5.37),
 ('Madalena', 'Sampaio', 5.37),
 ('Hannah', 'Schneider', 5.37),
 ('Niklas', 'Schröder', 5.37),
 ('Marc', 'Dubois', 5.37),
 ('Lucas', 'Mancini', 5.37),
 ('Stanisław', 'Wójcik', 5.37),
 ('Enrique', 'Muñoz', 5.37),
 ('Emma', 'Jones', 5.37),
 ('Phil', 'Hughes', 5.37),
 ('Steve', 'Murray', 5.37),
 ('Mark', 'Taylor', 5.37),
 ('Diego', 'Gutiérrez', 5.37)]

In [6]:
# Identify the customer who spent the most on music purchases. Display the customer's first and last name, along with the total amount spent.
five = %sql SELECT c.firstname, c.lastname, ROUND(SUM(i.total), 2) AS sum_total\
      FROM customers c \
      LEFT JOIN invoices i ON i.customerid = c.customerid \
      GROUP BY c.customerid ORDER BY sum_total DESC LIMIT 1;
display(five)

 * sqlite:///chinook.sqlite
Done.

[('Helena', 'Holý', 49.62)]